# coding=utf-8
                          #求台阶数
"""原题：
爱因斯坦曾出过这样一道有趣的数学题：
有一个长阶梯，若每步上2阶，最后剩1阶；
若每步上3阶，最后剩2阶；若每步上5阶，
最后剩4阶；若每步上6阶，最后剩5阶；
只有每步上7阶，最后刚好一阶也不剩。
"""
                                                   #个人答案
"""i = int()
while i < 100 :
    if (i % 2 == 1) and (i % 3 == 2)  and (i % 5 == 4)  and (i % 6 == 5)  and (i % 7 == 0):
        print ("至少有", i, "级阶梯")
    else:
        i = i * 7
        if (i % 2 == 1) and (i % 3 == 2)  and (i % 5 == 4)  and (i % 6 == 5):
            print ("至少有", i, "级阶梯")
    print
"""

"""
输出结果：无限输出，无法得到答案
"""

                                                         #参考答案
x = 7
i = 1
flag = 0
while i <= 100:
    if (x%2 == 1) and (x%3 == 2)  and (x%5 == 4)  and (x%6 == 5):
        flag = 1
    else:
        x = 7 * (i + 1)       # 根据题意，x一定是7的倍数
    i += 1

if flag == 1:
    print "阶梯数是: ", x
else:
    print "在程序限定范围内找不到答案！"



"""
输出结果：119
总结：Python2.0版本中，print 后面一般不需要加（），否则括号内输出的结果容易是乱码
"""

